Revit 2026 API

# FillPattern Methods

---

The FillPattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ExpandDots | Corrects pattern dots to make them be drawn properly for Revit. |
|  | ExportToPAT |  |
|  | GetFillGrid | Gets the specified fill grid. |
|  | GetFillGrids | Gets all fill grids in this fill pattern |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern. |
|  | SetFillGrid | Sets the fill grid. |
|  | SetFillGrids |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FillPattern Class

Autodesk.Revit.DB Namespace